# -*- mode:org; -*-

#+title:Clojure
#+subtitle:{{{version}}} {{{date}}}
#+author:Pinecone062
#+date:2020-01-29 23:48
#+macro:version Version 0.0.29

/{{{title}}}/ {{{version}}} compiled {{{date}}}

#+texinfo:@insertcopying


*** Leiningen                                                :dependencies:
:PROPERTIES:
:dependency1: shell
:dependency2: bash
:dependency3: java
:dependency4: clojure
:END:

This code checks for installed dependencies.  If something is not installed,
then the code in this Org project will not work properly.  Make sure you have
Java version 1.6 or later installed, and Bash version 4 or later installed.
Also make sure your Org setup can work with the programming languages 'shell
and 'clojure, in addition to 'elisp.  These should be added to
'org-babel-load-languages if they are not.

#+name:check-language-depencencies
#+header: :results output :exports results
#+begin_src elisp
  (princ "This will now check the Org variable \'org-babel-load-languages to make sure it includes 
  \'shell and \'clojure.\n\n")
  (if
      (assoc 'shell org-babel-load-languages)
      (princ "\'shell enabled\n")
    (princ "\'shell not enabled\n"))
  (if
      (assoc 'clojure org-babel-load-languages)
      (princ "\'clojure enabled")
    (princ "\'clojure not enabled"))
#+end_src

#+RESULTS: check-language-depencencies
: shell enabled
: clojure enabled

#+name:check-java-bash-dependencies
#+header: :results output :exports results
#+begin_src sh
echo "This will now check whether Java and Bash are installed on your system."
echo
echo Java:
java -version 2>&1
echo
echo Bash:
bash --version
#+end_src

#+RESULTS: check-java-bash-dependencies
: GNU bash, version 5.0.11(1)-release (x86_64-apple-darwin18.7.0)
: Copyright (C) 2019 Free Software Foundation, Inc.
: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
: 
: This is free software; you are free to change and redistribute it.
: There is NO WARRANTY, to the extent permitted by law.

#+cindex:Leiningen
Most Clojurists use Leiningen to build and manage their projects.  For now
we’ll focus on using it for four tasks:

1. Creating a new Clojure project

2. Running the Clojure project

3. Building the Clojure project

4. Using the REPL


#+cindex:@code{clojure.jar}
[[*Leiningen Installation Instructions][Install Leiningen]] using the instructions on the Leiningen home page at
http://leiningen.org.  When you install Leiningen, it automatically downloads
the Clojure compiler, ~clojure.jar~.

**** Running the Clojure Project

Open the source file ~src/clojure_noob/core.clj~ in an editor.  It should look
like this:

#+pindex:clojure_nobe/core.clj
#+caption: clojure-noob.core.clj File
#+name:initial-clojure_noob-core.clj
#+header: :results output verbatim
#+header: :exports results
#+header: :dir projects/clojure-noob/src/clojure_noob
#+begin_src sh
cat -n core.clj
#+end_src

#+RESULTS: initial-clojure_noob-core.clj
:      1	(ns clojure-noob.core
:      2	  (:gen-class))
:      3	
:      4	(defn -main
:      5	  "I don't do a whole lot ... yet."
:      6	  [& args]
:      7	  (println "Hello, World!"))

#+cindex:namespace
The code ~(ns ...)~ declares a /namespace/.  Do not worry about namespaces for
the moment.

#+cindex:entry point
#+cindex:@code{-main} function
The ~-main~ function is the /entry point/ to your program.

#+cindex:@code{lein run}
To run the program, navigate to the ~clojure_noob/~ directory and enter the
following command:

#+caption: Run a Project from the Command Line
#+name:run-project-clojure-noob
#+header: :dir projects/clojure-noob/src/clojure_noob
#+header: :results output :exports both
#+begin_src sh
lein run
#+end_src

#+RESULTS: run-project-clojure-noob
: Hello, World!

If you see “Hello, World!” output, then your Clojure project ran successfully.
You created a function ~-main~, and it runs when you execute ~lein run~ at the
command line.

**** Building the Clojure Project
#+cindex:jar file, create
You can create a stand-alone file that anyone with Java installed can execute.
To create the file, run this:

#+cindex:@command{lein uberjar}
#+caption:Create a jar File
#+name:create-first-jar-file
#+header: :dir projects/clojure-noob
#+header: :results output :exports both
#+begin_src sh
lein uberjar
#+end_src

#+RESULTS: create-first-jar-file
: Created /Users/pine/Dev/Languages/Clojure/Clojure/projects/clojure-noob/target/uberjar/clojure-noob-0.1.0-SNAPSHOT.jar
: Created /Users/pine/Dev/Languages/Clojure/Clojure/projects/clojure-noob/target/uberjar/clojure-noob-0.1.0-SNAPSHOT-standalone.jar

This command creates the file:

: ./target/uberjar/clojure-noob-0.1.0-SNAPSHOT-standalone.jar

You can make Java execute it by running this:

#+caption:Run a jar File
#+name:run-first-jar-file
#+header: :dir projects/clojure-noob
#+header: :results output :exports both
#+begin_src sh
java -jar target/uberjar/clojure-noob-0.1.0-SNAPSHOT-standalone.jar
#+end_src

#+RESULTS: run-first-jar-file
: Hello, World!

Again, if you see the output “Hello, World!” then Java has successfully run
your project from the ~.jar~ file.  You can distribute and run this program on
virtually every platform.

You now have all the basic details you need to build, run, and distribute
(very) basic Clojure programs.  In later chapters, you’ll learn more details
about what Leiningen is doing when you run the preceding commands, and gaining
a complete understanding of Clojure’s relationship to the JVM and how you cna
run production code.

** Get S3 Version
:PROPERTIES:
:dependency: ">= bash v4"
:END:
This program obtains the version number of the code currently uploaded to the
S3 bucket by obtaining a directory listing of top-level directories, which are
in the form ~PRE <dir>-v#.#.#/~, and performs a regular expression search with
a parenthesized match on the version numbers.  The program will exit with 'nil'
if there is no match, but will return the version number as a string if there
is a match.

Note that the regular expression matching requires at least Bash version 4 or
above.

#+caption:Get S3 Version
#+name:get-s3-version
#+header: :var dir=get-org-lc-filename()
#+header: :var file_version=get-file-version()
#+header: :results output
#+header: :eval yes
#+header: :shebang "#! /usr/bin/env bash"
#+begin_src sh
  if [[ ${file_version} = "v0.0.0/" ]]
  then
      echo -n "nil"

  else
      re=${dir}'-(v[[:digit:]]+\.[[:digit:]]+\.[[:digit:]]+)'

      # obtain a list of directories in the aws s2 bucket
      verpre=$(aws2 s3 ls s3://${AWS_S3_BUCKET}/)

      # check for a match; if one, return the version number; else return 'nil'
      if [[ $verpre =~ $re ]]
      then
		echo -n ${BASH_REMATCH[1]}/
      else
		echo -n "nil"
      fi
  fi
#+end_src

#+caption:Get S3 Elisp Version
#+name:get-s3-elisp-version
#+header: :var dir=get-org-lc-filename()
#+header: :var file_version=get-file-version()
#+header: :results output
#+header: :eval yes
#+begin_src emacs-lisp
  (setq re ; regexp of the form <dir>-v1.23.45/, extracting v1.23.45/
	(concat
	 (regexp-quote dir) ; <== use :var dir here
	 "-\\(v\\(?:[[:digit:]]+\\.?\\)\\{3\\}\\)\\/"))

  (setq str ; aws s3 ls s3://<bucket>; obtains string of directories-versions
	(shell-command-to-string
	 (concat
	  "aws2 s3 ls s3://"
	  (substitute-in-file-name "$AWS_S3_BUCKET")))) ; <== use env var here

  (if (string= file_version "v0.0.0/") ; <== use :var file-version here
      nil
    (progn
      (string-match re str) ; str =~ /re/, match using this directory
      (princ
       (match-string-no-properties 1 str)))) ; print the first subexpression, e.g. v1.23.45
#+end_src

#+RESULTS: get-s3-elisp-version
: v0.1.9

